jet_in_flow/3_refined_simulations/U1_0_1_U2_0_6/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|  controlDict for incompressible laminar jet test (icoFoam)                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     icoFoam;        // <-- this line defines the solver

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.2;             // shorter runtime for initial test

deltaT          0.001;          // smaller timestep for stability

writeControl    timeStep;
writeInterval   10;            // write every 10 timesteps

purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //

